{
  "name": "Kunj Chacha",
  "title": "Program Manager",
  "phone": "+917304042382",
  "email": "kunjnikhilchacha@gmail.com",
  "linkedin": "https://www.linkedin.com/in/kunjchacha",
  "headline": "Program Manager at Blenheim Chalcot | Building Innovative Technology Businesses",
  "profileSubtitle": "Transforming Processes, Maximizing Efficiency & Driving Strategic Growth",
  "about": "Results-driven business leader with 10+ years of experience in sales, operations, project management, and process automation across diverse industries. Proven ability to lead cross-functional teams, optimize workflows, and drive revenue growth, having successfully delivered INR 3.6 Cr+ in sales while improving operational efficiency by 40%. Experienced in strategic planning, stakeholder management, and with a track record of driving teams of 15-24 members to exceed performance targets. Adept at leveraging Salesforce, data analytics, and automation tools to enhance business processes and decision-making. A trusted advisor to senior leadership, skilled in negotiation and client relations. Passionate about driving scalable growth, operational excellence to deliver measurable impact in dynamic, high-growth environments. Now seeking to drive strategic business transformation, process optimization, and revenue growth in a dynamic, high-impact environment. Passionate about enhancing operational efficiency, scaling teams, and delivering data-driven solutions that drive measurable success.",
  "experience": [
    {
      "title": "Program Manager",
      "company": "Blenheim Chalcot India",
      "duration": "July 2023 – Present",
      "subtitle": "Process Automations & Transformation | Operational Excellence",
      "subtitle2": "Delivery Management & Strategy",
      "description": "Reported directly to CEO & Director of Technology & Finance Operations. Led client delivery for global B2B digital media firm, managing campaigns across finance, HR, and digital marketing verticals as Client & Delivery Manager for Contentive – BC's Portfolio Co. Led end-to-end automation initiatives for BC India, streamlining workflows (travel approvals, SOW, service packs) to reduce manual effort by 40% and save 200+ hours annually. Spearheaded campus recruitment drives for BITS Pilani and Indian School of Business, hiring 50+ professionals with a 95% retention rate through structured onboarding and performance tracking. Directed 15-member cross-functional teams to implement GitHub Copilot toolkit and API security audits, boosting developer productivity by 25% and ensuring 100% compliance. Designed and deployed BC India's Central Repository, improving document accessibility and reducing search time by 30%. Collaborated with C-suite to align ITC's senior-level recruitment strategy with business goals, filling 20+ leadership roles within 6 weeks (30% faster than industry average)."
    },
    {
      "title": "Senior Manager, Strategic Sales",
      "company": "Whitehat Jr",
      "duration": "July 2021 – Nov 2022",
      "subtitle": "Strategic Sales & Leadership | Process Transformation",
      "subtitle2": "Revenue Growth & Retention",
      "description": "Reported directly to Head of Sales & Operations. Career Progression: Promoted from Sales Manager → Senior Manager, leading UK sales operations with full ownership of pre-sales and post-sales support. Sales & Revenue Growth: UK market expansion, generating INR 3.64 Cr in revenue within 6 months, exceeding targets by 20%. Maintained an average deal size of INR 85,000, consistently surpassing weekly targets of INR 3.25 Lakh. Led a 12-member sales team, driving revenue of INR 22-25 Lakh/month, improving individual performance by 30% via Salesforce CRM coaching & pipeline optimization. Process & Operational Improvements: Revamped post-sales service workflows, increasing customer referral rates by 15% and reducing onboarding time by 50%. Partnered with marketing teams to launch BTL campaigns (direct mail, catalogues), boosting lead generation by 25% MoM. Salesforce CRM & Performance Tracking: Monitored pipeline data, won vs. lost opportunities, and lead response times to optimize sales strategy. Conducted coaching & counselling for sales personnel, improving conversion rates and team performance."
    },
    {
      "title": "Business Head",
      "company": "Flint Chem",
      "duration": "Dec 2020 – June 2021",
      "subtitle": "Process Automation & Improvements | Sales Funnel Development",
      "subtitle2": "Business Expansion & Operations",
      "description": "Business Development & Operations: Managed business development and operations for chemical distribution, optimizing inventory turnover by 15%. Marketed an entire branch of cosmetic products under MY CARE Brand. Sales & Revenue Growth: Successfully closed 35+ deals, Hired and managed a team of 70 employees using a pyramidal hierarchy structure, driving sales and on-site revenue. Channel & Sales Funnel Development: Built the entire sales distribution network from scratch for the cosmetics distribution line. Implemented sales funnel automation, improving lead conversion and efficiency. Resource & Team Management: Recruited and structured a full-scale sales team for an inception-stage company. Allocated resources efficiently to ensure a steady supply of raw materials for the manufacturing unit."
    },
    {
      "title": "Manager, Sales & Retention",
      "company": "Tech Mahindra Business Services Ltd",
      "duration": "May 2019 – Dec 2020",
      "subtitle": "Process Transformation | Operational Excellence",
      "subtitle2": "Client Relationship Management",
      "description": "Sales & Revenue Growth: Closed high-value B2B telecom contracts, achieving 110% of quarterly targets. Led a team of 14 professionals to maximize revenue via new sales, retention, and referral strategies. Client & Account Management: Absorbed by the client to manage Sales & Retention teams, focusing on upselling, negotiations, and client satisfaction. Handled customer service escalations, ensuring seamless service delivery. Process Transformation & Automation: Developed process automation initiatives to improve efficiency and sales workflows. Contributed to data-driven decision-making, optimizing customer retention efforts."
    },
    {
      "title": "Senior Customer Advisor, KYC Dept",
      "company": "Teleperformance",
      "duration": "Sept 2018 – April 2019",
      "subtitle": "KYC & Compliance | High-Risk Account Management",
      "subtitle2": "Workforce & Data Management",
      "description": "Banking Operations: Managed & conducted KYC verification for high-risk clientele for Barclays Bank, including Arms & Ammunition dealers, Government & Military contracts. Led Operations, Workforce Management (WFM), and MIS, handling data structuring. Gained extensive exposure to operations management, process optimization, and compliance handling in a highly specialized 30-member department."
    },
    {
      "title": "Customer Service & Sales Operations",
      "company": "Jet Airways | Concentrix",
      "duration": "May 2018 – Sept 2018",
      "subtitle": "Customer Service | Account Management",
      "subtitle2": "Sales & Business Development",
      "description": "Customer service and sales operations role with Jet Airways through Concentrix."
    }
  ],
  "awards": [
    {
      "title": "Star Performer",
      "company": "Blenheim Chalcot India",
      "year": "2024"
    },
    {
      "title": "Best Manager",
      "company": "Whitehat Jr",
      "year": "2022"
    },
    {
      "title": "Top Performer",
      "company": "Flint Chemical",
      "year": "2020"
    },
    {
      "title": "Innovation Excellence Award",
      "company": "Tech Mahindra",
      "year": "2019"
    }
  ],
  "references": [
    {
      "name": "Girish Manik",
      "title": "Former CEO",
      "company": "Blenheim Chalcot India",
      "phone": "+91982001212",
      "email": "girishmanik@gmail.com"
    },
    {
      "name": "Rohit Sareen",
      "title": "Chief Product Officer",
      "company": "Blenheim Chalcot India",
      "phone": "+919820462082",
      "email": "rohitdksareen@gmail.com"
    },
    {
      "name": "Reshma Kannan",
      "title": "HR Program Manager",
      "company": "Blenheim Chalcot India",
      "phone": "+919920908669",
      "email": "reshma0610@yahoo.com"
    },
    {
      "name": "Mairi-Claire Tay",
      "title": "Managing Director of Talent Acquisition",
      "company": "Blenheim Chalcot",
      "email": "mairi-claire.tay@blenheimchalcot.com"
    },
    {
      "name": "Valentina Dalpozzo",
      "title": "Head of Product",
      "company": "Contentive",
      "email": "valentina.dalpozzo@contentive.com"
    },
    {
      "name": "Swaha Patnaik",
      "title": "Senior Manager",
      "company": "Whitehat Jr",
      "phone": "+917829762714",
      "email": "swahapatnaik@gmail.com"
    }
  ],
  "lastUpdated": "2025-09-08T06:57:53.757Z",
  "source": "google_docs_real_sync",
  "syncTimestamp": "2025-09-08T06:57:53.806Z",
  "syncVersion": "1.0.0"
}